app/controllers/signspot/threads_controller.rb

INSERT INTO "signspot_threads" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 27 Jun 2012 18:34:11 UTC +00:00], ["updated_at", Wed, 27 Jun 2012 18:34:11 UTC +00:00]]
---
  def create
    @signspot_thread = Signspot::Thread.new(params[:signspot_thread])

    respond_to do |format|
      if @signspot_thread.save

DELETE FROM "signspot_threads" WHERE "signspot_threads"."id" = ?  [["id", 1]]
---
  def destroy
    @signspot_thread = Signspot::Thread.find(params[:id])
    @signspot_thread.destroy